In [1]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [2]:
from sqlalchemy import create_engine

In [3]:
import pandas as pd

In [4]:
!pip install cryptography

Requirement already satisfied: cryptography in c:\users\taitai\anaconda3\lib\site-packages (3.1.1)
Requirement already satisfied: six>=1.4.1 in c:\users\taitai\anaconda3\lib\site-packages (from cryptography) (1.15.0)
Requirement already satisfied: cffi!=1.11.3,>=1.8 in c:\users\taitai\anaconda3\lib\site-packages (from cryptography) (1.14.3)
Requirement already satisfied: pycparser in c:\users\taitai\anaconda3\lib\site-packages (from cffi!=1.11.3,>=1.8->cryptography) (2.20)

In [5]:
# Ссылка на дамп https://drive.google.com/file/d/1cXSREa9DLLKMRi5YKfGr-sblQycILdkG/view?usp=sharing
# подключение к БД
con = create_engine('mysql+pymysql://username:password@host/databasename')

In [6]:
def select(sql):
  return pd.read_sql(sql,con)

# Датасет

Пользователи платят за доступ к облачному хранилищу (таблица payments). Доступ можно купить на
разное количество дней (поле days). По пользователям есть агрегированная по дням статистика
(таблица downloads) c количеством скачанных за день файлов (поле downloads).

# Задача 1

Мы считаем ретеншн как процент пользователей, возвращающихся на сервис и что-либо
скачивающих в определенный день после покупки доступа. Напишите SQL-запрос, рассчитывающий
ретеншн первых 10 дней у пользователей, совершивших первую покупку после 1 октября 2020 года.
Интересуют скачивания только в оплаченные дни. Ожидаемый формат вывода:

<table>
    <tr>
        <td>Номер дня</td>
        <td>Retention</td>
    </tr>
    <tr>
        <td>0</td>
        <td>0,97</td>
    </tr>
    <tr>
        <td>1</td>
        <td>0,57</td>
    </tr>
    <tr>
        <td>...</td>
        <td>...</td>
    </tr>
</table>

# Решение

In [8]:
sql = """
 SELECT *
 FROM payments 
 LIMIT 5
"""
select(sql)

   id  user_id           date_paid  days
0   1        1 2018-10-01 07:59:57   365
1   2        2 2018-10-01 08:00:01   365
2   3        3 2018-10-01 08:00:05   365
3   4        4 2018-10-01 08:00:08   365
4   5        5 2018-10-01 08:00:11   365

In [9]:
sql = """
 SELECT COUNT(*) payments, COUNT(DISTINCT user_id) users
 FROM payments 
"""
select(sql)

   payments   users
0   1043745  344176

In [10]:
# Пользователи, совершившие первую покупку после 1 октября 2020 года, первая дата покупки (first_date) и количество покупок.
sql = """
SELECT  user_id, min(date_paid) as first_date, count(*) as cnt 
FROM payments 
GROUP BY user_id
HAVING MIN(date_paid) >= "2020-10-01" 
ORDER BY cnt DESC
LIMIT 5
"""
select(sql)

   user_id          first_date  cnt
0   328540 2020-10-04 16:39:04    8
1   332818 2020-10-16 22:16:12    7
2   329746 2020-10-08 07:44:03    6
3   329852 2020-10-08 14:40:36    6
4   329737 2020-10-08 06:47:11    5

In [12]:
# Подсчитаем число отфильтрованных пользователей. 
# В результате их около 5% от всех пользователей.
sql = """
WITH filtered_users AS ( 
  SELECT user_id, min(date_paid) as first_date 
  FROM payments 
  GROUP BY user_id
  HAVING MIN(date_paid) >= "2020-10-01" )
 
SELECT COUNT(*) filtered_users
FROM filtered_users
"""
select(sql)

   filtered_users
0           17037

In [14]:
"""
Для каждого из отфильтрованных пользователей, нужно посмотреть,
сколько было скачиваний в нулевой, первый, ..., десятый день после первой покупки.
"""

# Создадим представление (numbers), содержащую числа от 0 до 10, с помощью CTE
sql = """
WITH recursive numbers AS (
    SELECT 0 as num
    UNION ALL
    SELECT num + 1
    FROM numbers
    WHERE num < 10)

SELECT *
FROM numbers

"""
select(sql)

    num
0     0
1     1
2     2
3     3
4     4
5     5
6     6
7     7
8     8
9     9
10   10

In [18]:
"""
C помощью JOIN получаем декартово произведение таблиц filtered_users и numbers.
""" 
sql = """
WITH 
recursive numbers AS (
    SELECT 0 as num
    UNION ALL
    SELECT num + 1
    FROM numbers
    WHERE num < 10),
    
filtered_users AS ( 
  SELECT user_id, min(date_paid) as first_date 
  FROM payments 
  GROUP BY user_id
  HAVING MIN(date_paid) >= "2020-10-01" )    

SELECT *
FROM filtered_users JOIN numbers ON 1=1
ORDER BY user_id, num
LIMIT 10

"""
select(sql)

   user_id          first_date  num
0   319357 2020-10-02 00:29:41    0
1   319357 2020-10-02 00:29:41    1
2   319357 2020-10-02 00:29:41    2
3   319357 2020-10-02 00:29:41    3
4   319357 2020-10-02 00:29:41    4
5   319357 2020-10-02 00:29:41    5
6   319357 2020-10-02 00:29:41    6
7   319357 2020-10-02 00:29:41    7
8   319357 2020-10-02 00:29:41    8
9   319357 2020-10-02 00:29:41    9

In [19]:
"""
Далее модифицируем последний запрос таким образом, что бы получить дату первого, второго, ..., десятого дня после покупки.
Прибавим к дате первой покупки (first_date) номер дня (num), используя функцию DATE_ADD, 
результат запишем в поле day_num
"""
sql = """
WITH 
recursive numbers AS (
    SELECT 0 as num
    UNION ALL
    SELECT num + 1
    FROM numbers
    WHERE num < 10),
    
filtered_users AS ( 
  SELECT user_id, min(date_paid) as first_date 
  FROM payments 
  GROUP BY user_id
  HAVING MIN(date_paid) >= "2020-10-01" )    

SELECT *, DATE(DATE_ADD(first_date, INTERVAL num DAY)) as day_num
FROM filtered_users JOIN numbers ON 1=1
ORDER BY user_id, num
LIMIT 10

"""
select(sql)

   user_id          first_date  num     day_num
0   319357 2020-10-02 00:29:41    0  2020-10-02
1   319357 2020-10-02 00:29:41    1  2020-10-03
2   319357 2020-10-02 00:29:41    2  2020-10-04
3   319357 2020-10-02 00:29:41    3  2020-10-05
4   319357 2020-10-02 00:29:41    4  2020-10-06
5   319357 2020-10-02 00:29:41    5  2020-10-07
6   319357 2020-10-02 00:29:41    6  2020-10-08
7   319357 2020-10-02 00:29:41    7  2020-10-09
8   319357 2020-10-02 00:29:41    8  2020-10-10
9   319357 2020-10-02 00:29:41    9  2020-10-11

In [36]:
"""
Теперь нужно добавить число скачиваний в каждый из дней
Вынесли filtred_users_days 
"""
sql = """
WITH 
recursive numbers AS (
    SELECT 0 as num
    UNION ALL
    SELECT num + 1
    FROM numbers
    WHERE num < 10),
    
filtered_users AS ( 
  SELECT user_id, min(date_paid) as first_date 
  FROM payments 
  GROUP BY user_id
  HAVING MIN(date_paid) >= "2020-10-01" ),
  
filtred_users_days AS (
  SELECT user_id, num, DATE(DATE_ADD(first_date, INTERVAL num DAY)) as day_num
  FROM filtered_users JOIN numbers ON 1=1
)

SELECT u.user_id, num, date_download, downloads
FROM filtred_users_days u 
     LEFT JOIN downloads d ON u.user_id = d.user_id and u.day_num = DATE(d.date_download)
ORDER BY u.user_id, u.num
LIMIT 5

"""
select(sql)

   user_id  num date_download  downloads
0   319357    0    2020-10-02        4.0
1   319357    1          None        NaN
2   319357    2    2020-10-04        2.0
3   319357    3          None        NaN
4   319357    4          None        NaN

In [37]:
# Нужно также знать, у скольких людей активна подписка, т.к. интересуют скачивания только в оплаченные дни
# filtred_users_days добавили first_date
# 
sql = """
WITH 
recursive numbers AS (
    SELECT 0 as num
    UNION ALL
    SELECT num + 1
    FROM numbers
    WHERE num < 10),
    
filtered_users AS ( 
  SELECT user_id, min(date_paid) as first_date 
  FROM payments 
  GROUP BY user_id
  HAVING MIN(date_paid) >= "2020-10-01" ),
  
filtred_users_days AS (
  SELECT user_id, first_date, num, DATE(DATE_ADD(first_date, INTERVAL num DAY)) as day_num
  FROM filtered_users JOIN numbers ON 1=1
)

SELECT u.user_id, num, date_download, downloads, date_paid, days,
       CASE WHEN days > num THEN 1
            ELSE NULL
       END AS day_paid
FROM filtred_users_days u 
    LEFT JOIN downloads d ON u.user_id = d.user_id and u.day_num = DATE(d.date_download)
    LEFT JOIN payments p ON u.user_id = p.user_id and u.first_date = p.date_paid    
ORDER BY days, u.user_id, u.num
LIMIT 5

"""
select(sql)

   user_id  num date_download  downloads           date_paid  days  day_paid
0   327154    0    2020-10-01         28 2020-10-01 00:35:20     3       1.0
1   327154    1    2020-10-02         17 2020-10-01 00:35:20     3       1.0
2   327154    2    2020-10-03         29 2020-10-01 00:35:20     3       1.0
3   327154    3    2020-10-04         27 2020-10-01 00:35:20     3       NaN
4   327154    4    2020-10-05         18 2020-10-01 00:35:20     3       NaN

In [45]:
# Теперь Агрегируем результаты
sql = """
WITH 
recursive numbers AS (
    SELECT 0 as num
    UNION ALL
    SELECT num + 1
    FROM numbers
    WHERE num < 10),
    
filtered_users AS ( 
  SELECT user_id, min(date_paid) as first_date 
  FROM payments 
  GROUP BY user_id
  HAVING MIN(date_paid) >= "2020-10-01" ),
  
filtred_users_days AS (
  SELECT user_id, first_date, num, DATE(DATE_ADD(first_date, INTERVAL num DAY)) as day_num
  FROM filtered_users JOIN numbers ON 1=1
),

report AS (
  SELECT u.user_id, num, date_download, downloads, date_paid, days,
         CASE WHEN days > num THEN 1
              ELSE NULL
         END AS day_paid
  FROM filtred_users_days u 
       LEFT JOIN downloads d ON u.user_id = d.user_id and u.day_num = DATE(d.date_download)
       LEFT JOIN payments p ON u.user_id = p.user_id and u.first_date = p.date_paid  
)

SELECT num, COUNT(date_download), COUNT(day_paid), ROUND(COUNT(date_download)/COUNT(day_paid), 2)
FROM report
GROUP BY num
ORDER BY num
"""
select(sql)

,num,COUNT(date_download),COUNT(day_paid),"ROUND(COUNT(date_download)/COUNT(day_paid), 2)"
0,0,16473,17038,0.97
1,1,9637,17038,0.57
2,2,7466,17038,0.44
3,3,6390,16482,0.39
4,4,5394,16482,0.33
5,5,4838,16482,0.29
6,6,4720,16482,0.29
7,7,4592,16482,0.28
8,8,4111,16482,0.25
9,9,3717,16482,0.23
10,10,3517,16482,0.21

# Ответ

In [56]:
sql = """
WITH 
recursive numbers AS (
    SELECT 0 as num
    UNION ALL
    SELECT num + 1
    FROM numbers
    WHERE num < 10),
    
filtered_users AS ( 
  SELECT user_id, min(date_paid) as first_date 
  FROM payments 
  GROUP BY user_id
  HAVING MIN(date_paid) >= "2020-10-01" ),
  
filtred_users_days AS (
  SELECT user_id, first_date, num, DATE(DATE_ADD(first_date, INTERVAL num DAY)) as day_num
  FROM filtered_users JOIN numbers ON 1=1
),

report AS (
  SELECT u.user_id, num, date_download, downloads, date_paid, days,
         CASE WHEN days > num THEN 1
              ELSE NULL
         END AS day_paid
  FROM filtred_users_days u 
       LEFT JOIN downloads d ON u.user_id = d.user_id and u.day_num = DATE(d.date_download)
       LEFT JOIN payments p ON u.user_id = p.user_id and u.first_date = p.date_paid  
)

SELECT num as 'Номер дня', ROUND(COUNT(date_download)/COUNT(day_paid), 2) as 'Retention'
FROM report
GROUP BY num
ORDER BY num
"""
select(sql)

    Номер дня  Retention
0           0       0.97
1           1       0.57
2           2       0.44
3           3       0.39
4           4       0.33
5           5       0.29
6           6       0.29
7           7       0.28
8           8       0.25
9           9       0.23
10         10       0.21